samples/expression_tree_dot/deep_all_ops.dot
digraph expression {
  rankdir=TB;
  "node1" [label = "XOR", fillcolor = "lightpink", style = "filled", name = "node1"];
  "node2" [label = "AND", fillcolor = "lightgreen", style = "filled", name = "node2"];
  "node3" [label = "AND", fillcolor = "lightgreen", style = "filled", name = "node3"];
  "node4" [label = "NOT", fillcolor = "yellow", style = "filled", name = "node4"];
  "node5" [label = "OR", fillcolor = "lightcoral", style = "filled", name = "node5"];
  "node6" [label = "iota", fillcolor = "lightblue", style = "filled", name = "node6"];
  "node7" [label = "NOT", fillcolor = "yellow", style = "filled", name = "node7"];
  "node8" [label = "XOR", fillcolor = "lightpink", style = "filled", name = "node8"];
  "node9" [label = "zeta", fillcolor = "lightblue", style = "filled", name = "node9"];
  "node10" [label = "AND", fillcolor = "lightgreen", style = "filled", name = "node10"];
  "node11" [label = "kappa", fillcolor = "lightblue", style = "filled", name = "node11"];
  "node12" [label = "alpha", fillcolor = "lightblue", style = "filled", name = "node12"];
  "node13" [label = "AND", fillcolor = "lightgreen", style = "filled", name = "node13"];
  "node14" [label = "eta", fillcolor = "lightblue", style = "filled", name = "node14"];
  "node15" [label = "theta", fillcolor = "lightblue", style = "filled", name = "node15"];
  "node16" [label = "beta", fillcolor = "lightblue", style = "filled", name = "node16"];
  "node17" [label = "OR", fillcolor = "lightcoral", style = "filled", name = "node17"];
  "node18" [label = "gamma", fillcolor = "lightblue", style = "filled", name = "node18"];
  "node19" [label = "NOT", fillcolor = "yellow", style = "filled", name = "node19"];
  "node20" [label = "delta", fillcolor = "lightblue", style = "filled", name = "node20"];
  "node1" -> "node2" [label = "L"];
  "node1" -> "node3" [label = "R"];
  "node2" -> "node4" [label = "L"];
  "node2" -> "node5" [label = "R"];
  "node3" -> "node6" [label = "L"];
  "node3" -> "node7" [label = "R"];
  "node4" -> "node8";
  "node5" -> "node9" [label = "L"];
  "node5" -> "node10" [label = "R"];
  "node7" -> "node11";
  "node8" -> "node12" [label = "L"];
  "node8" -> "node13" [label = "R"];
  "node10" -> "node14" [label = "L"];
  "node10" -> "node15" [label = "R"];
  "node13" -> "node16" [label = "L"];
  "node13" -> "node17" [label = "R"];
  "node17" -> "node18" [label = "L"];
  "node17" -> "node19" [label = "R"];
  "node19" -> "node20";
}
